n = int(input('Введіть, будь ласка, число: '))
 
my_list1 = ["один", "два", "три", "чотири", "пять", "шість", "сім", "вісім", "девять", "десять", "одинацять", "дванадцять", "тринадцять", "чотирнадцять", "пятнадцять", "шістнадцять", "сімнадцять", "вісімнадцять", "девятнадцять"]
 
my_list2 = ["двадцять", "тридцять", "сорок", "пятдесят", "шістдесят", "сімдесят", "вісімдесят", "девяносто"]
 
my_list3 = ["сто", "двісті", "триста", "чотириста", "пятсот", "шістсот", "сімсот", "вісімcот", "девятсот"]
 
if n in range(1, 20):
    print(my_list1[n-1])
elif n >=20 and n<100:
    print(my_list2[n//10 - 2], end="")
    if n%10 > 0:
        print(" " + (my_list1[n%10 - 1]))
elif n>=100 and n<=999:
    print(my_list3[n//100 - 1], end = "")
    if n%100<=19 and n%100>0:
        print(" " + my_list1[n%100 - 1])
    else:
        if n%100>=20 and n%100<100:
            print(" " + my_list2[n%100//10 - 2], end = "")
        if n%10 > 0:
            print(" " + my_list1[n%100%10 - 1])
else:
    print("Ooops! Error. Number is to big.")

